Revit 2026 API

# IndependentTagGetTaggedReferences Method

---

Get the host references of the tag. An array of all the tagged references.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<Reference> GetTaggedReferences()
```
```vb
Public Function GetTaggedReferences As IList(Of Reference)
```
```cpp
public:
IList<Reference^>^ GetTaggedReferences()
```
```fsharp
member GetTaggedReferences : unit -> IList<Reference>
```

#### Return Value

IListReference

The references can be to an element or subelement in a local or linked document.

#### Reference

IndependentTag Class

Autodesk.Revit.DB Namespace